cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Core utilities
brew 'coreutils'      # GNU coreutils (gls, gdate, etc)
brew 'bat'            # better cat
brew 'fzf'            # fuzzy finder
brew 'gnu-sed'        # GNU sed
brew 'grep'           # GNU grep
brew 'httpie'         # HTTP client
brew 'jq'             # JSON processor
brew 'watch'          # watch command
brew 'wget'

# Version control
brew 'git'
brew 'git-lfs'

# Languages & runtimes
brew 'go'             # Golang
brew 'nvm'            # Node version manager

# Docker (using Colima as a lightweight alternative to Docker Desktop)
brew 'colima'
brew 'docker'
brew 'docker-compose'

# Kubernetes
brew 'kubernetes-cli'
brew 'kubectx'        # kubectl context/namespace switcher

# Databases
brew 'pgcli'          # Postgres CLI with autocomplete

# Shell enhancements
brew 'atuin'          # shell history sync
brew 'starship'       # cross-shell prompt
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Media & utilities
brew 'ffmpeg'
brew 'imagemagick'
brew 'spaceman-diff'  # image diffs in git

# -- Applications --

cask 'font-jetbrains-mono-nerd-font'
cask 'alfred'             # launcher
cask 'claude-code'
cask 'google-chrome'
cask 'iterm2'
cask 'maccy'              # clipboard manager
cask 'obsidian'           # notes
cask 'rectangle'          # window manager
cask 'slack'
cask 'spotify'
cask 'surfshark'          # VPN
cask 'tableplus'          # database GUI
cask 'telegram'
cask 'visual-studio-code'
cask 'zed'
cask 'zoom'
