anthropic.claude-code
eamodio.gitlens
esbenp.prettier-vscode
foxundermoon.shell-format
golang.go
ibm.output-colorizer
ms-azuretools.vscode-containers
ohanedan.lowlight-go-errors
renesaarsoo.sql-formatter-vsc
streetsidesoftware.code-spell-checker
